a = 1 # целое число
a = 1.0 # вещественное число
a = 1 + 1j # косплексное число
a = True # булевое число
a = None # пустой тип
a = 'hello'# строка
a = [1, 1.0,'hello']# список
a = (1, 1.0, 'hello')# кортеж
a = {1, 1.0, 'hello'}# множество
a = frozenset({1, 1.0,'hello'})# неизменяемое множество
a = {'a': 1, 'b': 2} # словарь
a = b'hello'# байтовый тип
a = bytearray(b'hello')
a = [1, 1.0, 'hello'] # создаем список
help(a) # выводим инфоомацию об 'a'
print(a) #выводим значение 'a' в консоль
b = input('Введи число') # в концоль вводим ссобщения и ожедается когда пользователь введет число
len(a) # сколько объектов в 'a'
min(a) # минимальное значение в 'a'
max(a) # максимальное значение в 'a'
type(a)# тип объекта 'a'
a = 1
a = 'новое значение переменной a'
some_var :int = 1
other_var :str = 'Hello World'
5 +1.1 # 6.1




